#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.covidshield_key_retrieval_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "covidshield_key_retrieval_task"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "METRIC_PROVIDER"
                          + value = "${metric_provider}"
                        },
                      + {
                          + name  = "TRACER_PROVIDER"
                          + value = "${tracer_provider}"
                        },
                      + {
                          + name  = "ENV"
                          + value = "${env}"
                        },
                      + {
                          + name  = "METRICS_USERNAME"
                          + value = "${metrics_username}"
                        },
                    ]
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + name             = "key-retrieval"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "KEY_CLAIM_TOKEN"
                          + valueFrom = "${key_claim_token}"
                        },
                      + {
                          + name      = "RETRIEVE_HMAC_KEY"
                          + valueFrom = "${retrieve_hmac_key}"
                        },
                      + {
                          + name      = "ECDSA_KEY"
                          + valueFrom = "${ecdsa_key}"
                        },
                      + {
                          + name      = "DATABASE_URL"
                          + valueFrom = "${database_url}"
                        },
                      + {
                          + name      = "METRICS_PASSWORD"
                          + valueFrom = "${metrics_password}"
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "awslogs-group"         = "CovidShield"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-KeyRetrieval"
          + "database_url"          = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:server-database-url-ymzi27-AhOoLD"
          + "ecdsa_key"             = (known after apply)
          + "env"                   = "demo"
          + "image"                 = "445131834497.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-retrieval"
          + "key_claim_token"       = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-submission-env-key-claim-token-ymzi27-ctDs6X"
          + "metric_provider"       = "stdout"
          + "metrics_password"      = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-metric-password-ymzi27-iaJwHm"
          + "metrics_username"      = "rX8MZ24f1qYiaUXmNVgF"
          + "retrieve_hmac_key"     = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-hmac-key-ymzi27-z6S5xz"
          + "tracer_provider"       = "stdout"
        }
    }

  # aws_api_gateway_deployment.metrics must be replaced
+/- resource "aws_api_gateway_deployment" "metrics" {
      ~ created_date  = "2021-04-28T20:15:23Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:445131834497:v1o7d57660/" -> (known after apply)
      ~ id            = "edgg45" -> (known after apply)
      ~ invoke_url    = "https://v1o7d57660.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "2021-04-28T20:15:22Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.metrics will be updated in-place
  ~ resource "aws_api_gateway_stage" "metrics" {
      ~ deployment_id         = "edgg45" -> (known after apply)
        id                    = "ags-v1o7d57660-demo"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_api_gateway_usage_plan.metrics_usage_plan will be created
  + resource "aws_api_gateway_usage_plan" "metrics_usage_plan" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "in-app-metrics-key_usage_plan"

      + api_stages {
          + api_id = "v1o7d57660"
          + stage  = "demo"
        }
    }

  # aws_api_gateway_usage_plan_key.main will be created
  + resource "aws_api_gateway_usage_plan_key" "main" {
      + id            = (known after apply)
      + key_id        = "en5arm2qtg"
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.save_metrics_average_duration will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "save_metrics_average_duration" {
      ~ alarm_description         = "This metric monitors average duration for the backoff_retry lambda" -> "This metric monitors average duration for the save_metrics lambda"
      ~ dimensions                = {
          ~ "FunctionName" = "backoff_retry" -> "save-metrics"
        }
        id                        = "save-metrics-average-duration"
        tags                      = {}
        # (15 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.covidshield_key_retrieval must be replaced
-/+ resource "aws_ecs_task_definition" "covidshield_key_retrieval" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:445131834497:task-definition/KeyRetrieval:27" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "ENV"
                          - value = "demo"
                        },
                      - {
                          - name  = "METRICS_USERNAME"
                          - value = "rX8MZ24f1qYiaUXmNVgF"
                        },
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "445131834497.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-retrieval"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeyRetrieval"
                        }
                    }
                  - mountPoints      = []
                  - name             = "key-retrieval"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                          - hostPort      = 8001
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-submission-env-key-claim-token-ymzi27-ctDs6X"
                        },
                      - {
                          - name      = "RETRIEVE_HMAC_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-hmac-key-ymzi27-z6S5xz"
                        },
                      - {
                          - name      = "ECDSA_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:server-database-url-ymzi27-AhOoLD"
                        },
                      - {
                          - name      = "METRICS_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-metric-password-ymzi27-iaJwHm"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "KeyRetrieval" -> (known after apply)
      ~ revision                 = 27 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_lb.covidshield_key_retrieval will be updated in-place
  ~ resource "aws_lb" "covidshield_key_retrieval" {
        id                         = "arn:aws:elasticloadbalancing:ca-central-1:445131834497:loadbalancer/app/covidshield-key-retrieval/b1940e8300e9e9a7"
        name                       = "covidshield-key-retrieval"
        tags                       = {
            "CostCentre" = "CovidShield"
            "Name"       = "covidshield-key-retrieval"
        }
        # (14 unchanged attributes hidden)

      ~ access_logs {
          + bucket  = "cbs-satellite-account-bucket445131834497"
          ~ enabled = false -> true
          + prefix  = "445131834497/elb_logs_v2"
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lb.covidshield_key_submission will be updated in-place
  ~ resource "aws_lb" "covidshield_key_submission" {
        id                         = "arn:aws:elasticloadbalancing:ca-central-1:445131834497:loadbalancer/app/covidshield-key-submission/bf583bf6161a0916"
        name                       = "covidshield-key-submission"
        tags                       = {
            "CostCentre" = "CovidShield"
            "Name"       = "covidshield-key-submission"
        }
        # (14 unchanged attributes hidden)

      ~ access_logs {
          + bucket  = "cbs-satellite-account-bucket445131834497"
          ~ enabled = false -> true
          + prefix  = "445131834497/elb_logs_v2"
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.cloudfront_logs will be updated in-place
  ~ resource "aws_s3_bucket" "cloudfront_logs" {
        id                          = "covid-shield-demo-cloudfront-logs"
        tags                        = {}
        # (9 unchanged attributes hidden)



      + logging {
          + target_bucket = "cbs-satellite-account-bucket445131834497"
          + target_prefix = "445131834497/s3_access_logs/covid-shield-demo-cloudfront-logs/"
        }


        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket.exposure_config will be updated in-place
  ~ resource "aws_s3_bucket" "exposure_config" {
        id                          = "covid-shield-exposure-config-demo"
        tags                        = {}
        # (9 unchanged attributes hidden)

      + logging {
          + target_bucket = "cbs-satellite-account-bucket445131834497"
          + target_prefix = "445131834497/s3_access_logs/covid-shield-exposure-config-demo/"
        }


        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.firehose_waf_logs will be updated in-place
  ~ resource "aws_s3_bucket" "firehose_waf_logs" {
        id                          = "covid-shield-demo-waf-logs"
        tags                        = {}
        # (9 unchanged attributes hidden)


      + logging {
          + target_bucket = "cbs-satellite-account-bucket445131834497"
          + target_prefix = "445131834497/s3_access_logs/covid-shield-demo-waf-logs/"
        }


        # (3 unchanged blocks hidden)
    }

  # aws_secretsmanager_secret_version.key_retrieval_env_ecdsa_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "key_retrieval_env_ecdsa_key" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN|24676F69-CBA3-43F2-816C-5758B7AD8C55" -> (known after apply)
      ~ secret_string  = (sensitive value)
      ~ version_id     = "24676F69-CBA3-43F2-816C-5758B7AD8C55" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.in_app_metrics.data.aws_iam_policy_document.write_s3_metrics_csv_buckets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "write_s3_metrics_csv_buckets"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::masked-metrics-gtlmt-demo",
              + "arn:aws:s3:::unmasked-metrics-gtlmt-demo",
            ]
        }
    }

  # module.in_app_metrics.aws_cloudwatch_event_target.tigger-masked_metrics will be created
  + resource "aws_cloudwatch_event_target" "tigger-masked_metrics" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "twice-a-day"
      + target_id      = "masked_metrics"
    }

  # module.in_app_metrics.aws_cloudwatch_event_target.tigger-unmasked_metrics will be created
  + resource "aws_cloudwatch_event_target" "tigger-unmasked_metrics" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "twice-a-day"
      + target_id      = "unmasked_metrics"
    }

  # module.in_app_metrics.aws_cloudwatch_log_group.masked_metrics will be created
  + resource "aws_cloudwatch_log_group" "masked_metrics" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/masked_metrics"
      + retention_in_days = 14
    }

  # module.in_app_metrics.aws_cloudwatch_log_group.unmasked_metrics will be created
  + resource "aws_cloudwatch_log_group" "unmasked_metrics" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/unmasked_metrics"
      + retention_in_days = 14
    }

  # module.in_app_metrics.aws_iam_policy.write_s3_metrics_csv_buckets will be updated in-place
  ~ resource "aws_iam_policy" "write_s3_metrics_csv_buckets" {
        id        = "arn:aws:iam::445131834497:policy/CovidAlertWriteS3CSVBuckets"
        name      = "CovidAlertWriteS3CSVBuckets"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::unmasked-metrics-gtlmt-demo",
                          - "arn:aws:s3:::masked-metrics-gtlmt-demo",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (3 unchanged attributes hidden)
    }

  # module.in_app_metrics.aws_lambda_function.masked_metrics will be created
  + resource "aws_lambda_function" "masked_metrics" {
      + arn                            = (known after apply)
      + function_name                  = "masked_metrics"
      + id                             = (known after apply)
      + image_uri                      = "445131834497.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::445131834497:role/backoff_lambda_role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME" = "masked-metrics-gtlmt-demo"
              + "MASK_DATA"   = "true"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0ea6776ab3b8c34c2",
            ]
          + subnet_ids         = [
              + "subnet-004f7bd4f9af4d6d4",
              + "subnet-08241ad4f1968ece8",
              + "subnet-0e62dcdf9b0516543",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.in_app_metrics.aws_lambda_function.unmasked_metrics will be created
  + resource "aws_lambda_function" "unmasked_metrics" {
      + arn                            = (known after apply)
      + function_name                  = "unmasked_metrics"
      + id                             = (known after apply)
      + image_uri                      = "445131834497.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::445131834497:role/backoff_lambda_role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME" = "unmasked-metrics-gtlmt-demo"
              + "MASK_DATA"   = "false"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0ea6776ab3b8c34c2",
            ]
          + subnet_ids         = [
              + "subnet-004f7bd4f9af4d6d4",
              + "subnet-08241ad4f1968ece8",
              + "subnet-0e62dcdf9b0516543",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.in_app_metrics.aws_lambda_permission.allow-cloudwatch-to-call-masked_metrics will be created
  + resource "aws_lambda_permission" "allow-cloudwatch-to-call-masked_metrics" {
      + action        = "lambda:InvokeFunction"
      + function_name = "masked_metrics"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = "arn:aws:events:ca-central-1:445131834497:rule/twice-a-day"
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.in_app_metrics.aws_lambda_permission.allow-cloudwatch-to-call-unmasked_metrics will be created
  + resource "aws_lambda_permission" "allow-cloudwatch-to-call-unmasked_metrics" {
      + action        = "lambda:InvokeFunction"
      + function_name = "unmasked_metrics"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = "arn:aws:events:ca-central-1:445131834497:rule/twice-a-day"
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.in_app_metrics.aws_s3_bucket.masked_metrics will be updated in-place
  ~ resource "aws_s3_bucket" "masked_metrics" {
        id                          = "masked-metrics-gtlmt-demo"
        tags                        = {}
        # (9 unchanged attributes hidden)

      + logging {
          + target_bucket = "cbs-satellite-account-bucket445131834497"
          + target_prefix = "445131834497/s3_access_logs/masked-metrics-gtlmt-demo/"
        }


        # (2 unchanged blocks hidden)
    }

  # module.in_app_metrics.aws_s3_bucket.unmasked_metrics will be updated in-place
  ~ resource "aws_s3_bucket" "unmasked_metrics" {
        id                          = "unmasked-metrics-gtlmt-demo"
        tags                        = {}
        # (9 unchanged attributes hidden)

      + logging {
          + target_bucket = "cbs-satellite-account-bucket445131834497"
          + target_prefix = "445131834497/s3_access_logs/unmasked-metrics-gtlmt_demo/"
        }


        # (2 unchanged blocks hidden)
    }

Plan: 13 to add, 10 to change, 3 to destroy.

Changes to Outputs:
  ~ base_url = "https://v1o7d57660.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @patheard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*